In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv(r"C:\Users\ummar\Downloads\Expanded_data_with_more_features.csv.zip")
df.head()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30641 entries, 0 to 30640
Data columns (total 15 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           30641 non-null  int64
 1   Gender               30641 non-null  object
 2   EthnicGroup          28801 non-null  object
 3   ParentEduc           28796 non-null  object
 4   LunchType            30641 non-null  object
 5   TestPrep             28811 non-null  object
 6   ParentMaritalStatus  29451 non-null  object
 7   PracticeSport        30010 non-null  object
 8   IsFirstChild         29737 non-null  object
 9   NrSiblings           29069 non-null  float64
 10  TransportMeans       27507 non-null  object
 11  WklyStudyHours       29686 non-null  object
 12  MathScore            30641 non-null  int64
 13  ReadingScore         30641 non-null  int64
 14  WritingScore         30641 non-null  int64
dtypes: float64(1), int64(4), object(10)
memory usage: 3.5+ MB

In [4]:
df.drop(columns="Unnamed: 0")

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,female,NaN,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,female,group C,some college,standard,NaN,married,sometimes,yes,0.0,NaN,5 - 10,69,90,88
2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,NaN,5 - 10,45,56,42
4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30636,female,group D,high school,standard,none,single,sometimes,no,2.0,school_bus,5 - 10,59,61,65
30637,male,group E,high school,standard,none,single,regularly,no,1.0,private,5 - 10,58,53,51
30638,female,NaN,high school,free/reduced,completed,married,sometimes,no,1.0,private,5 - 10,61,70,67
30639,female,group D,associate's degree,standard,completed,married,regularly,no,3.0,school_bus,5 - 10,82,90,93
30640,male,group B,some college,standard,none,married,never,no,1.0,school_bus,5 - 10,64,60,58

In [5]:
df.shape

(30641, 15)

In [6]:
df.isnull().sum()

Unnamed: 0                0
Gender                    0
EthnicGroup            1840
ParentEduc             1845
LunchType                 0
TestPrep               1830
ParentMaritalStatus    1190
PracticeSport           631
IsFirstChild            904
NrSiblings             1572
TransportMeans         3134
WklyStudyHours          955
MathScore                 0
ReadingScore              0
WritingScore              0
dtype: int64

In [7]:
df.isnull().sum()/(df.shape[0]*100)

Unnamed: 0             0.000000
Gender                 0.000000
EthnicGroup            0.000601
ParentEduc             0.000602
LunchType              0.000000
TestPrep               0.000597
ParentMaritalStatus    0.000388
PracticeSport          0.000206
IsFirstChild           0.000295
NrSiblings             0.000513
TransportMeans         0.001023
WklyStudyHours         0.000312
MathScore              0.000000
ReadingScore           0.000000
WritingScore           0.000000
dtype: float64

In [8]:
df["EthnicGroup"].value_counts().reset_index().sort_values(by="EthnicGroup" ,ascending=True)

  EthnicGroup  count
4     group A   2219
2     group B   5826
0     group C   9212
1     group D   7503
3     group E   4041

In [9]:
df["EthnicGroup"].isnull().sum()

1840

In [10]:
df["EthnicGroup"]=df["EthnicGroup"].replace(np.nan,"group A")

In [11]:
df["ParentEduc"].value_counts().reset_index()

           ParentEduc  count
0        some college   6633
1         high school   5687
2  associate's degree   5550
3    some high school   5517
4   bachelor's degree   3386
5     master's degree   2023

In [12]:
df["ParentEduc"].isnull().sum()

1845

In [13]:
df["ParentEduc"]=df["ParentEduc"].fillna(method="bfill")

C:\Users\ummar\AppData\Local\Temp\ipykernel_14148\1479556788.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["ParentEduc"]=df["ParentEduc"].fillna(method="bfill")

In [14]:
df["TestPrep"].value_counts().reset_index()

    TestPrep  count
0       none  18856
1  completed   9955

In [15]:
df["TestPrep"]=df["TestPrep"].replace(np.nan,"completed")

In [16]:
df["ParentMaritalStatus"].isnull().sum()

1190

In [17]:
df["ParentMaritalStatus"].value_counts().reset_index()

  ParentMaritalStatus  count
0             married  16844
1              single   7097
2            divorced   4919
3             widowed    591

In [18]:
df["ParentMaritalStatus"]=df["ParentMaritalStatus"].fillna(method="bfill")

C:\Users\ummar\AppData\Local\Temp\ipykernel_14148\3155282762.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["ParentMaritalStatus"]=df["ParentMaritalStatus"].fillna(method="bfill")

In [19]:
df["PracticeSport"].isnull().sum()

631

In [20]:
df["PracticeSport"].value_counts().reset_index()

  PracticeSport  count
0     sometimes  15213
1     regularly  10793
2         never   4004

In [21]:
df["PracticeSport"]=df["PracticeSport"].replace(np.nan,"never")

In [22]:
df["IsFirstChild"].isnull().sum()

904

In [23]:
df["IsFirstChild"].value_counts().reset_index()

  IsFirstChild  count
0          yes  19082
1           no  10655

In [24]:
df["IsFirstChild"]=df["IsFirstChild"].fillna(method="bfill")

C:\Users\ummar\AppData\Local\Temp\ipykernel_14148\2626150717.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["IsFirstChild"]=df["IsFirstChild"].fillna(method="bfill")

In [25]:
df["NrSiblings"].isnull().sum()

1572

In [26]:
df["NrSiblings"].value_counts().reset_index()

   NrSiblings  count
0         1.0   8217
1         2.0   6790
2         3.0   6123
3         0.0   3085
4         4.0   2941
5         5.0   1320
6         6.0    302
7         7.0    291

In [27]:
df["NrSiblings"]=df["NrSiblings"].fillna(method="bfill")

C:\Users\ummar\AppData\Local\Temp\ipykernel_14148\1476048788.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["NrSiblings"]=df["NrSiblings"].fillna(method="bfill")

In [28]:
df["TransportMeans"].isnull().sum()

3134

In [29]:
df["TransportMeans"].value_counts().reset_index()

  TransportMeans  count
0     school_bus  16145
1        private  11362

In [30]:
df["TransportMeans"]=df["TransportMeans"].replace(np.nan,"private")

In [31]:
df["WklyStudyHours"].isnull().sum()

955

In [32]:
df["WklyStudyHours"].value_counts().reset_index()

  WklyStudyHours  count
0         5 - 10  16246
1            < 5   8238
2           > 10   5202

In [33]:
df["WklyStudyHours"]=df["WklyStudyHours"].fillna(method="bfill")

C:\Users\ummar\AppData\Local\Temp\ipykernel_14148\293615989.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["WklyStudyHours"]=df["WklyStudyHours"].fillna(method="bfill")

In [34]:
df.isnull().sum()/(df.shape[0])*100

Unnamed: 0             0.0
Gender                 0.0
EthnicGroup            0.0
ParentEduc             0.0
LunchType              0.0
TestPrep               0.0
ParentMaritalStatus    0.0
PracticeSport          0.0
IsFirstChild           0.0
NrSiblings             0.0
TransportMeans         0.0
WklyStudyHours         0.0
MathScore              0.0
ReadingScore           0.0
WritingScore           0.0
dtype: float64

In [35]:
df.head()

,Unnamed: 0,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore
0,0,female,group A,bachelor's degree,standard,none,married,regularly,yes,3.0,school_bus,< 5,71,71,74
1,1,female,group C,some college,standard,completed,married,sometimes,yes,0.0,private,5 - 10,69,90,88
2,2,female,group B,master's degree,standard,none,single,sometimes,yes,4.0,school_bus,< 5,87,93,91
3,3,male,group A,associate's degree,free/reduced,none,married,never,no,1.0,private,5 - 10,45,56,42
4,4,male,group C,some college,standard,none,married,sometimes,yes,0.0,school_bus,5 - 10,76,78,75

In [36]:
round(df["MathScore"].mean(),3)

66.558

In [37]:
round(df["MathScore"].median(),3)

67.0

In [38]:
df["MathScore"].mode()

0    64
Name: MathScore, dtype: int64

In [39]:
df["NrSiblings"]=df["NrSiblings"].astype("int")

In [40]:
df["WklyStudyHours"]=df["WklyStudyHours"].str.replace("<","")

In [41]:
df["WklyStudyHours"]

0             5
1        5 - 10
2             5
3        5 - 10
4        5 - 10
          ...
30636    5 - 10
30637    5 - 10
30638    5 - 10
30639    5 - 10
30640    5 - 10
Name: WklyStudyHours, Length: 30641, dtype: object

In [42]:
df.drop(columns="Unnamed: 0",inplace=True)

In [43]:
import seaborn as sns

In [44]:
df["Average_marks"]=(df["MathScore"]+df["ReadingScore"]+df["WritingScore"])/3

In [45]:
df["Average_marks"]=round(df["Average_marks"],2)

In [46]:
df.loc[df["Average_marks"]>=85,"Award of Class"]="First Class"
df.loc[df["Average_marks"]<85, "Award of Class"]="Second Class"
df.loc[df["Average_marks"]<65,"Award of Class"]="Third Class"

In [47]:
df["Award of Class"].head()

0    Second Class
1    Second Class
2     First Class
3     Third Class
4    Second Class
Name: Award of Class, dtype: object

In [70]:
df.head()

,Gender,EthnicGroup,ParentEduc,LunchType,TestPrep,ParentMaritalStatus,PracticeSport,IsFirstChild,NrSiblings,TransportMeans,WklyStudyHours,MathScore,ReadingScore,WritingScore,Average_marks,Award of Class
0,Female,Group A,bachelor's degree,standard,none,married,regularly,yes,3,school_bus,5,71,71,74,72.00,Second Class
1,Female,Group C,some college,standard,completed,married,sometimes,yes,0,private,5 - 10,69,90,88,82.33,Second Class
2,Female,Group B,master's degree,standard,none,single,sometimes,yes,4,school_bus,5,87,93,91,90.33,First Class
3,Male,Group A,associate's degree,free/reduced,none,married,never,no,1,private,5 - 10,45,56,42,47.67,Third Class
4,Male,Group C,some college,standard,none,married,sometimes,yes,0,school_bus,5 - 10,76,78,75,76.33,Second Class

In [49]:
df.shape

(30641, 16)

In [69]:
df["Gender"]=df["Gender"].str.replace("FeMaleMFeMaleaFeMalelFeMaleeFeMale","Male")
df["Gender"]=df["Gender"].str.replace("FeMale","Female")

In [71]:
df.to_excel("updated resultAnalysis.xlsx")